cracked-machine/dsp_notch_filter_sw/cube_workspace/STM32F405RG/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

#include "stm32f4xx_ll_adc.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_pwr.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_tim.h"
#include "stm32f4xx_ll_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define FootSwitchA_Pin LL_GPIO_PIN_13
#define FootSwitchA_GPIO_Port GPIOC
#define FootSwitchB_Pin LL_GPIO_PIN_14
#define FootSwitchB_GPIO_Port GPIOC
#define RelayCoilOut_Pin LL_GPIO_PIN_0
#define RelayCoilOut_GPIO_Port GPIOC
#define ToggleSwitchA_Pin LL_GPIO_PIN_1
#define ToggleSwitchA_GPIO_Port GPIOC
#define ToggleSwitchB_Pin LL_GPIO_PIN_2
#define ToggleSwitchB_GPIO_Port GPIOC
#define AnalogExpIn_Pin LL_GPIO_PIN_0
#define AnalogExpIn_GPIO_Port GPIOA
#define LEDA_Red_Pin LL_GPIO_PIN_0
#define LEDA_Red_GPIO_Port GPIOB
#define LEDA_Green_Pin LL_GPIO_PIN_1
#define LEDA_Green_GPIO_Port GPIOB
#define LEDA_Blue_Pin LL_GPIO_PIN_2
#define LEDA_Blue_GPIO_Port GPIOB
#define LEDB_Red_Pin LL_GPIO_PIN_10
#define LEDB_Red_GPIO_Port GPIOA
#define LEDB_Green_Pin LL_GPIO_PIN_11
#define LEDB_Green_GPIO_Port GPIOA
#define LEDB_Blue_Pin LL_GPIO_PIN_12
#define LEDB_Blue_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
